# EyePosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HomeCamera..::..EyePosition Property
HomeCamera Class See Also
---
The eye position point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ EyePosition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EyePosition As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ EyePosition {
	XYZ^ get ();
}
```

# See Also
HomeCamera Class
Autodesk.Revit.DB Namespace